app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY comments.created_at  [["post_id", 12]]
---
<h3>コメント一覧</h3>
<% @post.comments.each do|comment| %>