app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "eeeeeeew"], ["body", "ffffff"], ["post_id", 1], ["created_at", 2017-02-10 11:44:33 UTC], ["updated_at", 2017-02-10 11:44:33 UTC]]