app/controllers/posts_controller.rb

	def create
		#render plain: params[:post].inspect
		@post = Post.new(post_params)
		if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "first app"], ["body", "this is the test"], ["created_at", 2017-02-10 08:45:30 UTC], ["updated_at", 2017-02-10 08:45:30 UTC]]

	def update
		@post = Post.find(params[:id])

		if(@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "There you go check it out"], ["body", "hope it works okay?"], ["updated_at", 2017-02-10 11:21:28 UTC], ["id", 3]]